Mizuho32/esp32-kvm-ip/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# 8MB flash (mds/usb_hid/2026-08-28_mruby_filter_route.md's target
# hardware) - custom partitions.csv gives the app partition 3MB, well
# above the default table's 1MB (mruby alone pushes the Host role image
# past 2MB) with headroom for growth and the Phase2 script-storage
# partition that design doc's next step will add.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 8192 (default 3584): app_main() (task "main") calls mruby_filter_init()
# on this task, and mruby's VM init + Prism parser overflowed the default
# stack on real hardware - see mds/usb_hid/2026-08-29_mruby_phase1_impl.md.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# USB OTG (ESP32-S3 native USB)
CONFIG_TINYUSB_HID_COUNT=3

# Boards like Seeed XIAO ESP32S3 expose only a single USB-C port wired to
# the native USB pins (GPIO19/20). Once TinyUSB claims that port as the
# Boot Keyboard/Mouse device, it can no longer also serve as a USB-Serial-
# JTAG console. Route the console to UART0 instead (XIAO silkscreen D6/D7 =
# GPIO43/44 = default UART0 TX/RX) so logs stay available via an external
# USB-UART adapter. Flashing is unaffected - it uses the ROM bootloader's
# own download-mode driver on the same port, independent of this setting.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Runtime per-task CPU stats (vTaskGetRunTimeStats()) - used to find
# what's starving usb_host_rp2040_bridge.c's bridge_task for tens of ms
# at a time (mds/usb_hid/2026-08-24_rp2040_bridge_fps_investigation.md). Trace
# facility is a prerequisite for the runtime-stats option.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# USB Host (Host role only, KVM_ROLE=HOST) - enables Hub-connected devices.
# Harmless when unused (Device role never installs the USB Host driver).
CONFIG_USB_HOST_HUBS_SUPPORTED=y

# PSRAM (Seeed XIAO ESP32S3 uses an ESP32-S3R8 module - 8MB Octal PSRAM
# in-package, matching mds/usb_hid/2026-08-28_mruby_filter_route.md's
# "想定ハードウェア"). Added to fix an intermittent WebUI "out of memory"
# 500 that came from competing with mruby's VM heap/task stacks for the
# ~300-400K of internal SRAM alone - see
# mds/usb_hid/2026-08-30_mruby_phase2_webui.md.
#
# SPIRAM_USE_CAPS_ALLOC (not the default SPIRAM_USE_MALLOC) deliberately
# keeps plain malloc() internal-only - mruby's VM heap and the
# latency-sensitive mouse dispatch path (mds/usb_hid/2026-08-24_rp2040_bridge_fps_investigation.md)
# are untouched by this change. Only main/mruby_webui.c's own buffers
# explicitly opt in via heap_caps_malloc(..., MALLOC_CAP_SPIRAM).
#
# SPIRAM_IGNORE_NOTFOUND: if this assumption about the board's PSRAM is
# wrong (wrong module variant, or genuinely absent), boot proceeds
# without PSRAM instead of aborting - mruby_webui.c's heap_caps_malloc()
# calls then simply return NULL and fall back to regular malloc(), same
# behavior as before this change (see mruby_webui.c's webui_alloc()).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
